Curso_CFD_OS_2025/cylinder/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
  top
    {
           type            symmetryPlane; 

	   //       type            fixedValue;
	   //value           uniform (1 0 0);
    }

  left
    {
	   type            fixedValue;
	   value           uniform (1 0 0);
    }



  right
    {
        type            inletOutlet;
        value           $internalField;
        inletValue      uniform (0 0 0);
//        type            zeroGradient;
    }

  bottom
    {
                 type            symmetryPlane; 
		 //        type            noSlip;
    }

    cylinder
    {    
      type      noSlip;
    }

  
    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
